In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['w','X','Y','Z'])

In [13]:
df

          w         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df['w']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: w, dtype: float64

In [22]:
type(df)

pandas.core.frame.DataFrame

In [30]:
df[['w','Z']]

          w         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [34]:
df['new']=df['w'] + df['Y']

In [35]:
df

          w         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [36]:
#axis=1 for column
df.drop('new',axis=1,inplace=True)

In [37]:
#drop row does not requires any axis to be mentioned by default it's axis=0
df.drop('E')

          w         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [38]:
df.shape

(5, 4)

In [40]:
#it represents the row 
df.loc['C']

w   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [42]:
#it represents the row at index 2
df.iloc[2]

w   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [39]:
#prints the specific index value row,column
df.loc['B','Y']

-0.8480769834036315

In [43]:
#prints the specific index value row,column
#can provide the list of [row],[column]
df.loc[['A','B'],['w','Y']]

          w         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [46]:
#DF Part2
df

          w         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
booldf

       w      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [54]:
booldf = df > 0
df[booldf]

          w         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df[df["w"]>0]

          w         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df["Z"]<0]

          w         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [57]:
resultdf = df[df['w']>0]

In [60]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [61]:
df[df['w']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [65]:
boolser = df['w']>0
boolser

A     True
B     True
C    False
D     True
E     True
Name: w, dtype: bool

In [68]:
result = df[boolser]
result

          w         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [73]:
df[df['w']>0]

          w         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
df[df['Y']>1]

          w         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [76]:
df[(df['w']>0) & (df['Y']>1)]

          w         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df

          w         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [78]:
newInd = "CA NY WY OR CO".split()
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

In [80]:
df['States']=newInd
df

          w         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [85]:
#permanent change the index using the inplace = True

df.set_index('States')

               w         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [53]:
#DATA Frame 3
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [52]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [53]:
inside

[1, 2, 3, 1, 2, 3]

In [54]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [55]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [56]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [57]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [58]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [59]:
df.index.names

FrozenList([None, None])

In [60]:
df.index.names = ['Groups','Num']

In [62]:
df.index.names

FrozenList(['Groups', 'Num'])

In [64]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [67]:
#skips 
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [69]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [70]:
#Missing Data

In [86]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [89]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [92]:
#drops the row if one or more values is missing
#for coloumn axis = 1
df.dropna()

     A    B  C
0  1.0  5.0  1

In [93]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [100]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [101]:
#Fill values
df.fillna(value="FILL VALUE")

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [102]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [103]:
df['A'].fillna(value= df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [109]:
#group by
data = {'company':['GOOG','GOOG',"MSFT",'MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [115]:
df = pd.DataFrame(data)
df

  company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [117]:
byComp = df.groupby('company')
byComp

In [119]:
#returns mean
byComp.mean()

         Sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [120]:
byComp.sum()

         Sales
company
FB         593
GOOG       320
MSFT       464

In [121]:
byComp.std()

              Sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [122]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [124]:
df.groupby('company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [ ]:
df.groupby('company').min